//     #bAUsaq6LI
//     - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте  скрипт при a, що дорівнює 1, 0, -3

// При x = 1

let x = 1;

if(x !== 0){
    console.log('Вірно');
} else{
    console.log('Невірно');
}

// При x = 0

// let x = 1;
//
// if(x !== 0){
//     console.log('Вірно');
// } else{
//     console.log('Невірно');
// }

// При x = -3

// let x = 1;
//
// if(x !== 0){
//     console.log('Вірно');
// } else{
//     console.log('Невірно');
// }





// Функція

// function a(x) {
//
// if(x !== 0){
//     console.log('Вірно');
// } else{
//     console.log('Невірно');
// }}
//
// a(1);
// a(0);
// a(-3);