// #qLQLJSeN7i
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

const array = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
// let i = 0;
// while (i < array.length){
//     console.log(array[i]);
//     i++;
// }
//
// // 2. перебрати його циклом for
// for (let a = 0; a <array.length; a++){
//     console.log(array[a]);
// }
//
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let b = 0;
// while (b < array.length){
//     if (b % 2 !== 0) {
//         console.log(array[b]);
//     }
//     b++;
// }
//
// // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let r = 0; r <array.length; r++){
//     if (r % 2 !== 0) {
//         console.log(array[r]);
//     }
// }
//
// // 5. перебрати циклом while та вивести  числа тільки парні  значення
// let t = 0;
// while (t < array.length){
//     if (array[t] % 2 === 0) {
//         console.log(array[t]);
//     }
//     t++;
// }
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let y = 0; y <array.length; y++){
//     if (array[y] % 2 === 0) {
//         console.log(array[y]);
//     }
// }
//
// 7. замінити кожне число кратне 3 на слово "okten"
// for (let y = 0; y <array.length; y++){
//     let text = 'okten';
//     if (array[y] % 3 === 0) {
//         array[y] = text;
//     }
// }
// console.log(array);
//
// 8. вивести масив в зворотньому порядку.
// for (let p = array.length - 1; p >= 0; p--){
//     console.log(array[p]);
// }
//



